---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.GeometryObject
source: html/c750db66-af1e-5a06-ccf2-7343ec594f89.htm
---
# GeometryObject Members

Causes the object to release immediately any resources it may be utilizing.